nickfox-taterli/stm32n647-template/app/Core/Src/drivers/camera_demo.c
#include "camera_demo.h"

#include "FreeRTOS.h"
#include "task.h"

#include <string.h>

#include "imx415.h"
#include "rgb_lcd.h"
#include "ai_instance_segmentation.h"
#include "app_config.h"
#include "console_log.h"
#include "stm32n647xx.h"
#include "stm32n6xx_ll_bus.h"
#include "stm32n6xx_ll_rcc.h"

#define CAMERA_SRC_WIDTH             3864U
#define CAMERA_SRC_HEIGHT            2192U
#define CAMERA_PREVIEW_WIDTH         512U
#define CAMERA_PREVIEW_HEIGHT        300U
#define CAMERA_ISP_WIDTH             (CAMERA_SRC_WIDTH / 2U)
#define CAMERA_ISP_HEIGHT            (CAMERA_SRC_HEIGHT / 2U)
#define CAMERA_PREVIEW_PITCH_BYTES   (CAMERA_PREVIEW_WIDTH * sizeof(uint16_t))
#define CAMERA_PREVIEW_BYTES         (CAMERA_PREVIEW_PITCH_BYTES * CAMERA_PREVIEW_HEIGHT)
#define CAMERA_CAPTURE_TIMEOUT_MS    1000U
#define CAMERA_PIPE2_WAIT_MS         20U
/* Keep the camera scaler synchronized with the generated model input. */
#define CAMERA_AI_WIDTH              NN_WIDTH
#define CAMERA_AI_HEIGHT             NN_HEIGHT
#define CAMERA_AI_PITCH_BYTES        (CAMERA_AI_WIDTH * 3U)
#define CAMERA_AI_CROP_SIZE          CAMERA_ISP_HEIGHT
#define CAMERA_AI_CROP_X             ((CAMERA_ISP_WIDTH - CAMERA_AI_CROP_SIZE) / 2U)
#define CAMERA_AI_HRATIO             ((CAMERA_AI_CROP_SIZE * 8192U) / CAMERA_AI_WIDTH)
#define CAMERA_AI_VRATIO             ((CAMERA_AI_CROP_SIZE * 8192U) / CAMERA_AI_HEIGHT)
#define CAMERA_AI_HDIV               ((CAMERA_AI_WIDTH * 1023U + CAMERA_AI_CROP_SIZE / 2U) / CAMERA_AI_CROP_SIZE)
#define CAMERA_AI_VDIV               ((CAMERA_AI_HEIGHT * 1023U + CAMERA_AI_CROP_SIZE / 2U) / CAMERA_AI_CROP_SIZE)
#define CAMERA_PIPE1_ROI_COUNT       8U
#define CAMERA_PIPE1_ROI_LINE_SIZE   1U /* 2 pixels, encoded as 01. */
/* Boot with the sensor in normal (non-pattern) mode; TPG is toggled at runtime
 * via `cam tpg`. The pending-controls apply on frame 1 keeps this in sync. */
#define CAMERA_USE_TEST_PATTERN      0U

#define DCMIPP_DT_RAW10              0x2BU
#define DCMIPP_CSI_DT_BPP10          3U
#define DCMIPP_CSI_TWO_DATA_LANES    (2U << CSI_LMCFGR_LANENB_Pos)
#define DCMIPP_CSI_DATA_LANE0        1U
#define DCMIPP_CSI_DATA_LANE1        2U
#define DCMIPP_MODE_SNAPSHOT         DCMIPP_P1FCTCR_CPTMODE
#define DCMIPP_SERIAL_MODE           DCMIPP_CMCR_INSEL
#define DCMIPP_PIXEL_PACKER_RGB565   (1U << DCMIPP_P1PPCR_FORMAT_Pos)
/* P1DMCR TYPE encodings, matching the STM32N6 HAL (DCMIPP_RAWBAYER_*). */
#define DCMIPP_RAWBAYER_RGGB         (0U << DCMIPP_P1DMCR_TYPE_Pos)
#define DCMIPP_RAWBAYER_GRBG         (1U << DCMIPP_P1DMCR_TYPE_Pos)
#define DCMIPP_RAWBAYER_GBRG         (2U << DCMIPP_P1DMCR_TYPE_Pos)
#define DCMIPP_RAWBAYER_BGGR         (3U << DCMIPP_P1DMCR_TYPE_Pos)
#define DCMIPP_ISP_HDEC_1_OUT_2      (1U << DCMIPP_P1DECR_HDEC_Pos)
#define DCMIPP_ISP_VDEC_1_OUT_2      (1U << DCMIPP_P1DECR_VDEC_Pos)
#define DCMIPP_DOWNSIZE_HRATIO       ((CAMERA_ISP_WIDTH * 8192U) / CAMERA_PREVIEW_WIDTH)
#define DCMIPP_DOWNSIZE_VRATIO       ((CAMERA_ISP_HEIGHT * 8192U) / CAMERA_PREVIEW_HEIGHT)
#define DCMIPP_DOWNSIZE_HDIV         ((CAMERA_PREVIEW_WIDTH * 1023U + (CAMERA_ISP_WIDTH / 2U)) / CAMERA_ISP_WIDTH)
#define DCMIPP_DOWNSIZE_VDIV         ((CAMERA_PREVIEW_HEIGHT * 1023U + (CAMERA_ISP_HEIGHT / 2U)) / CAMERA_ISP_HEIGHT)

/* White balance gain window, units of x1000 (1000 == 1.0x). */
#define CAMERA_WB_MIN_X1000          250U
#define CAMERA_WB_MAX_X1000          4000U
/* Default white-balance gains (warm-tuned). */
#define CAMERA_WB_DEFAULT_R_X1000    2500U
#define CAMERA_WB_DEFAULT_G_X1000    1000U
#define CAMERA_WB_DEFAULT_B_X1000    1500U

/* Dirty bits tracking which pending controls diverge from the active hardware
 * state. Set by the shell setters, consumed by the camera task. */
#define CAMERA_CTRL_DIRTY_EXPOSURE    (1UL << 0)
#define CAMERA_CTRL_DIRTY_AGAIN       (1UL << 1)
#define CAMERA_CTRL_DIRTY_WB          (1UL << 2)
#define CAMERA_CTRL_DIRTY_BAYER       (1UL << 3)
#define CAMERA_CTRL_DIRTY_TPG         (1UL << 4)
#define CAMERA_CTRL_DIRTY_SWAP_RB     (1UL << 5)
#define CAMERA_CTRL_DIRTY_ALL         0x3FUL

static uint16_t s_camera_preview[CAMERA_PREVIEW_WIDTH * CAMERA_PREVIEW_HEIGHT]
  __attribute__((aligned(32)));
static CameraDemoDebug s_camera_debug;
static uint8_t s_ai_capture_armed;
static TaskHandle_t s_camera_task;

static CameraDemoControls s_active_controls =
{
  .exposure_lines = IMX415_DEMO_EXPOSURE_LINES,
  .analog_gain = IMX415_DEMO_ANALOG_GAIN,
  .wb_r_x1000 = CAMERA_WB_DEFAULT_R_X1000,
  .wb_g_x1000 = CAMERA_WB_DEFAULT_G_X1000,
  .wb_b_x1000 = CAMERA_WB_DEFAULT_B_X1000,
  .bayer = CAMERA_BAYER_GBRG,
  .test_pattern = IMX415_TEST_PATTERN_OFF,
  .swap_rb = 0U,
};

static CameraDemoControls s_pending_controls =
{
  .exposure_lines = IMX415_DEMO_EXPOSURE_LINES,
  .analog_gain = IMX415_DEMO_ANALOG_GAIN,
  .wb_r_x1000 = CAMERA_WB_DEFAULT_R_X1000,
  .wb_g_x1000 = CAMERA_WB_DEFAULT_G_X1000,
  .wb_b_x1000 = CAMERA_WB_DEFAULT_B_X1000,
  .bayer = CAMERA_BAYER_GBRG,
  .test_pattern = IMX415_TEST_PATTERN_OFF,
  .swap_rb = 0U,
};

/* Starts fully dirty so the very first snapshot programs every default into
 * the hardware, keeping the active cache and the live registers in sync. */
static volatile uint32_t s_control_dirty = CAMERA_CTRL_DIRTY_ALL;

static IMX415_DebugRegisters s_sensor_debug;

static void CameraDemo_UpdateSensorDebug(void)
{
  (void)IMX415_GetDebugRegisters(&s_sensor_debug);
}


static void CameraDemo_UpdateDebug(void)
{
  s_camera_debug.csi_sr0 = CSI->SR0;
  s_camera_debug.csi_err1 = CSI->ERR1;
  s_camera_debug.csi_err2 = CSI->ERR2;
  s_camera_debug.dcmipp_p1sr = DCMIPP->P1SR;
  s_camera_debug.dcmipp_p1fscr = DCMIPP->P1FSCR;
  s_camera_debug.dcmipp_p1ppm0ar1 = DCMIPP->P1PPM0AR1;
  s_camera_debug.dcmipp_p1dmcr = DCMIPP->P1DMCR;
  s_camera_debug.dcmipp_p1ppcr = DCMIPP->P1PPCR;
  s_camera_debug.dcmipp_p1decr = DCMIPP->P1DECR;
  s_camera_debug.dcmipp_p1excr1 = DCMIPP->P1EXCR1;
  s_camera_debug.dcmipp_p1excr2 = DCMIPP->P1EXCR2;
  s_camera_debug.dcmipp_p1cmricr = DCMIPP->P1CMRICR;
  s_camera_debug.dcmipp_p1ri1cr1 = DCMIPP->P1RIxCR1;
  s_camera_debug.dcmipp_p1ri1cr2 = DCMIPP->P1RIxCR2;
  s_camera_debug.dcmipp_p2sr = DCMIPP->P2SR;
  s_camera_debug.dcmipp_p2ppcr = DCMIPP->P2PPCR;
}

static void CameraDemo_UpdateFrameBufferStats(void)
{
  uint16_t minv = 0xFFFFU;
  uint16_t maxv = 0U;

  SCB_InvalidateDCache_by_Addr((uint32_t *)s_camera_preview, sizeof(s_camera_preview));
  for (uint32_t i = 0; i < (CAMERA_PREVIEW_WIDTH * CAMERA_PREVIEW_HEIGHT); i += 97U)
  {
    uint16_t v = s_camera_preview[i];

    if (v < minv)
    {
      minv = v;
    }
    if (v > maxv)
    {
      maxv = v;
    }
  }

  s_camera_debug.fb_min = minv;
  s_camera_debug.fb_max = maxv;
}

static void CameraDemo_CopyPreviewToLcd(void)
{
  uint16_t *fb = RGB_LCD_GetFrameBuffer();

  SCB_InvalidateDCache_by_Addr((uint32_t *)s_camera_preview, sizeof(s_camera_preview));
  /* Keep the preview at its native 512x300 size. The remaining LCD area is
   * initialized to black once; only the sensor/display scan direction is
   * corrected here. Clearing the live framebuffer every frame makes LTDC scan
   * partially black frames and causes severe flicker. */
  for (uint32_t y = 0; y < CAMERA_PREVIEW_HEIGHT; y++)
  {
    /* The panel scan direction is opposite to the IMX415/ISP line order. */
    uint32_t sy = CAMERA_PREVIEW_HEIGHT - 1U - y;
    const uint16_t *src = &s_camera_preview[sy * CAMERA_PREVIEW_WIDTH];
    uint16_t *dst = &fb[y * RGB_LCD_WIDTH];

    if (s_active_controls.swap_rb == 0U)
    {
      memcpy(dst, src, CAMERA_PREVIEW_PITCH_BYTES);
    }
    else
    {
      for (uint32_t x = 0; x < CAMERA_PREVIEW_WIDTH; x++)
      {
        uint16_t pixel = src[x];

