nickfox-taterli/stm32n647-template/app/Core/Src/drivers/camera_demo.c
        dst[x] = (uint16_t)(((pixel & 0x001FU) << 11) |
                            ( pixel & 0x07E0U)        |
                            ((pixel & 0xF800U) >> 11));
      }
    }
  }

  RGB_LCD_FlushRows(0U, CAMERA_PREVIEW_HEIGHT);
}

static uint32_t CameraDemo_NormalizedToPreviewX(float normalized)
{
  float source_x = (float)CAMERA_AI_CROP_X +
                   (normalized * (float)CAMERA_AI_CROP_SIZE);

  if (source_x <= 0.0f)
  {
    return 0U;
  }
  if (source_x >= (float)CAMERA_ISP_WIDTH)
  {
    return CAMERA_PREVIEW_WIDTH;
  }
  return (uint32_t)((source_x * (float)CAMERA_PREVIEW_WIDTH /
                     (float)CAMERA_ISP_WIDTH) + 0.5f);
}

static uint32_t CameraDemo_NormalizedToPreviewY(float normalized)
{
  float source_y = normalized * (float)CAMERA_AI_CROP_SIZE;

  if (source_y <= 0.0f)
  {
    return 0U;
  }
  if (source_y >= (float)CAMERA_ISP_HEIGHT)
  {
    return CAMERA_PREVIEW_HEIGHT;
  }
  return (uint32_t)((source_y * (float)CAMERA_PREVIEW_HEIGHT /
                     (float)CAMERA_ISP_HEIGHT) + 0.5f);
}

static void CameraDemo_UpdatePipe1Rois(void)
{
  AIInstanceSegmentationBox boxes[CAMERA_PIPE1_ROI_COUNT];
  volatile uint32_t *roi_registers = &DCMIPP->P1RIxCR1;
  uint32_t box_count = AIInstanceSegmentation_GetBoxes(boxes,
                                                        CAMERA_PIPE1_ROI_COUNT);
  uint32_t common = CAMERA_PIPE1_ROI_LINE_SIZE;

  for (uint32_t i = 0; i < CAMERA_PIPE1_ROI_COUNT; ++i)
  {
    roi_registers[i * 2U] = 0U;
    roi_registers[(i * 2U) + 1U] = 0U;
  }

  if (box_count > CAMERA_PIPE1_ROI_COUNT)
  {
    box_count = CAMERA_PIPE1_ROI_COUNT;
  }

  for (uint32_t i = 0; i < box_count; ++i)
  {
    float x0_normalized = boxes[i].x_center - (boxes[i].width * 0.5f);
    float x1_normalized = boxes[i].x_center + (boxes[i].width * 0.5f);
    float y0_normalized = boxes[i].y_center - (boxes[i].height * 0.5f);
    float y1_normalized = boxes[i].y_center + (boxes[i].height * 0.5f);
    uint32_t x0 = CameraDemo_NormalizedToPreviewX(x0_normalized);
    uint32_t x1 = CameraDemo_NormalizedToPreviewX(x1_normalized);
    uint32_t y0 = CameraDemo_NormalizedToPreviewY(y0_normalized);
    uint32_t y1 = CameraDemo_NormalizedToPreviewY(y1_normalized);

    if (x1 <= x0)
    {
      x1 = (x0 < CAMERA_PREVIEW_WIDTH) ? (x0 + 1U) : x0;
    }
    if (y1 <= y0)
    {
      y1 = (y0 < CAMERA_PREVIEW_HEIGHT) ? (y0 + 1U) : y0;
    }
    if ((x0 >= CAMERA_PREVIEW_WIDTH) || (y0 >= CAMERA_PREVIEW_HEIGHT) ||
        (x1 <= x0) || (y1 <= y0))
    {
      continue;
    }
    if (x1 > CAMERA_PREVIEW_WIDTH)
    {
      x1 = CAMERA_PREVIEW_WIDTH;
    }
    if (y1 > CAMERA_PREVIEW_HEIGHT)
    {
      y1 = CAMERA_PREVIEW_HEIGHT;
    }
    if ((x1 <= x0) || (y1 <= y0))
    {
      continue;
    }

    /* DCMIPP ROI coordinates are in Pipe1's post-downsize 512x300 output.
     * Pipe2 sees a 320x320 square crop from the half-resolution ISP image;
     * map the detection back through that crop before programming Pipe1. */
    roi_registers[i * 2U] =
      ((x0 << DCMIPP_P1RIxCR1_HSTART_Pos) & DCMIPP_P1RIxCR1_HSTART) |
      ((y0 << DCMIPP_P1RIxCR1_VSTART_Pos) & DCMIPP_P1RIxCR1_VSTART) |
      (3U << DCMIPP_P1RIxCR1_CLG_Pos);
    roi_registers[(i * 2U) + 1U] =
      (((x1 - x0) << DCMIPP_P1RIxCR2_HSIZE_Pos) & DCMIPP_P1RIxCR2_HSIZE) |
      (((y1 - y0) << DCMIPP_P1RIxCR2_VSIZE_Pos) & DCMIPP_P1RIxCR2_VSIZE);
    common |= (1UL << (DCMIPP_P1CMRICR_ROI1EN_Pos + i));
  }

  DCMIPP->P1CMRICR = common;
}

static void CameraDemo_CSI_WritePHYReg(uint32_t reg_msb, uint32_t reg_lsb, uint32_t val)
{
  CSI->PTCR1 |= CSI_PTCR1_TWM;
  CSI->PTCR0 |= CSI_PTCR0_TCKEN;
  CSI->PTCR1 |= CSI_PTCR1_TWM;
  CSI->PTCR0 = 0U;
  CSI->PTCR1 = 0U;
  CSI->PTCR1 |= (reg_msb & 0xFFU);
  CSI->PTCR0 |= CSI_PTCR0_TCKEN;
  CSI->PTCR0 = 0U;
  CSI->PTCR1 |= CSI_PTCR1_TWM;
  CSI->PTCR0 |= CSI_PTCR0_TCKEN;
  CSI->PTCR1 |= CSI_PTCR1_TWM | (reg_lsb & 0xFFU);
  CSI->PTCR0 = 0U;
  CSI->PTCR1 = 0U;
  CSI->PTCR1 |= (val & 0xFFU);
  CSI->PTCR0 |= CSI_PTCR0_TCKEN;
  CSI->PTCR0 = 0U;
}

static void CameraDemo_ClockInit(void)
{
  LL_RCC_IC17_Disable();
  LL_RCC_IC17_SetSource(LL_RCC_ICCLKSOURCE_PLL1);
  LL_RCC_IC17_SetDivider(4U);
  LL_RCC_IC17_Enable();
  LL_RCC_SetDCMIPPClockSource(LL_RCC_DCMIPP_CLKSOURCE_IC17);

  LL_RCC_IC18_Disable();
  LL_RCC_IC18_SetSource(LL_RCC_ICCLKSOURCE_PLL1);
  LL_RCC_IC18_SetDivider(60U);
  LL_RCC_IC18_Enable();

  LL_APB5_GRP1_EnableClock(LL_APB5_GRP1_PERIPH_DCMIPP);
  LL_APB5_GRP1_EnableClock(LL_APB5_GRP1_PERIPH_CSI);
  LL_APB5_GRP1_ForceReset(LL_APB5_GRP1_PERIPH_DCMIPP | LL_APB5_GRP1_PERIPH_CSI);
  LL_APB5_GRP1_ReleaseReset(LL_APB5_GRP1_PERIPH_DCMIPP | LL_APB5_GRP1_PERIPH_CSI);
}

static void CameraDemo_DCMIPPInterruptInit(void)
{
  NVIC_SetPriority(DCMIPP_IRQn,
                   NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 6U, 0U));
  NVIC_ClearPendingIRQ(DCMIPP_IRQn);
  NVIC_EnableIRQ(DCMIPP_IRQn);
}

static CameraDemoStatus CameraDemo_CSIInit(void)
{
  CameraDemo_ClockInit();

  CSI->CR &= ~CSI_CR_CSIEN;
  CSI->LMCFGR = DCMIPP_CSI_TWO_DATA_LANES |
                (DCMIPP_CSI_DATA_LANE0 << CSI_LMCFGR_DL0MAP_Pos) |
                (DCMIPP_CSI_DATA_LANE1 << CSI_LMCFGR_DL1MAP_Pos);
  CSI->CR |= CSI_CR_CSIEN;

  CSI->VC0CFGR1 = (DCMIPP_CSI_DT_BPP10 << CSI_VC0CFGR1_CDTFT_Pos) |
                  CSI_VC0CFGR1_ALLDT;

  CSI->PRCR &= ~CSI_PRCR_PEN;
  CSI->PCR = 0U;
  CSI->PTCR0 |= CSI_PTCR0_TCKEN;
  vTaskDelay(pdMS_TO_TICKS(1));
  CSI->PTCR0 = 0U;

  CSI->PFCR = (0x28U << CSI_PFCR_CCFR_Pos) | (0x29U << CSI_PFCR_HSFR_Pos);
  CameraDemo_CSI_WritePHYReg(0x00U, 0x08U, 0x38U);
  CameraDemo_CSI_WritePHYReg(0x00U, 0xE4U, 0x11U);
  CameraDemo_CSI_WritePHYReg(0x00U, 0xE3U, 460U >> 8);
  CameraDemo_CSI_WritePHYReg(0x00U, 0xE3U, 460U & 0xFFU);
  CSI->PFCR = (0x28U << CSI_PFCR_CCFR_Pos) |
              (0x29U << CSI_PFCR_HSFR_Pos) |
              CSI_PFCR_DLD;
  CSI->PCR = CSI_PCR_DL0EN | CSI_PCR_DL1EN | CSI_PCR_CLEN | CSI_PCR_PWRDOWN;
  CSI->PRCR |= CSI_PRCR_PEN;
  CSI->PMCR = 0U;

  DCMIPP->CMCR |= DCMIPP_SERIAL_MODE;
  DCMIPP->P1FSCR = DCMIPP_DT_RAW10;
  DCMIPP->P1FCTCR = 0U;
  DCMIPP->P1PPCR = DCMIPP_PIXEL_PACKER_RGB565;
  DCMIPP->P1PPM0PR = CAMERA_PREVIEW_PITCH_BYTES << DCMIPP_P1PPM0PR_PITCH_Pos;
  /*
   * 3864 pixels is too wide for direct demosaic. Feed the ISP with a
   * half-resolution Bayer frame before final preview downsize.
   */
  DCMIPP->P1DECR = DCMIPP_P1DECR_ENABLE |
                   DCMIPP_ISP_HDEC_1_OUT_2 |
                   DCMIPP_ISP_VDEC_1_OUT_2;
  DCMIPP->P1DSCR = (DCMIPP_DOWNSIZE_HDIV << DCMIPP_P1DSCR_HDIV_Pos) |
                   (DCMIPP_DOWNSIZE_VDIV << DCMIPP_P1DSCR_VDIV_Pos) |
                   DCMIPP_P1DSCR_ENABLE;
  DCMIPP->P1DSRTIOR = (DCMIPP_DOWNSIZE_HRATIO << DCMIPP_P1DSRTIOR_HRATIO_Pos) |
                      (DCMIPP_DOWNSIZE_VRATIO << DCMIPP_P1DSRTIOR_VRATIO_Pos);
  DCMIPP->P1DSSZR = (CAMERA_PREVIEW_WIDTH << DCMIPP_P1DSSZR_HSIZE_Pos) |
                    (CAMERA_PREVIEW_HEIGHT << DCMIPP_P1DSSZR_VSIZE_Pos);
  DCMIPP->P1DMCR = DCMIPP_P1DMCR_ENABLE | DCMIPP_RAWBAYER_GBRG;
  DCMIPP->P1FCR = DCMIPP_P1FCR_CFRAMEF | DCMIPP_P1FCR_COVRF |
                  DCMIPP_P1FCR_CVSYNCF;
  DCMIPP->P1IER = DCMIPP_P1IER_FRAMEIE;
  CameraDemo_DCMIPPInterruptInit();

