nickfox-taterli/stm32n647-template/app/Core/Src/drivers/camera_demo.c
  /* Pipe2 branches after Pipe1 ISP. Crop the IMX415 image to a centered
   * square, resize in hardware and write packed RGB888 straight into the
   * network input buffer. */
  DCMIPP->P2FSCR = DCMIPP_DT_RAW10;
  DCMIPP->P2FCTCR = 0U;
  DCMIPP->P2CRSTR = (CAMERA_AI_CROP_X << DCMIPP_P2CRSTR_HSTART_Pos);
  DCMIPP->P2CRSZR = (CAMERA_AI_CROP_SIZE << DCMIPP_P2CRSZR_HSIZE_Pos) |
                    (CAMERA_AI_CROP_SIZE << DCMIPP_P2CRSZR_VSIZE_Pos) |
                    DCMIPP_P2CRSZR_ENABLE;
  DCMIPP->P2DSCR = (CAMERA_AI_HDIV << DCMIPP_P2DSCR_HDIV_Pos) |
                   (CAMERA_AI_VDIV << DCMIPP_P2DSCR_VDIV_Pos) |
                   DCMIPP_P2DSCR_ENABLE;
  DCMIPP->P2DSRTIOR = (CAMERA_AI_HRATIO << DCMIPP_P2DSRTIOR_HRATIO_Pos) |
                      (CAMERA_AI_VRATIO << DCMIPP_P2DSRTIOR_VRATIO_Pos);
  DCMIPP->P2DSSZR = (CAMERA_AI_WIDTH << DCMIPP_P2DSSZR_HSIZE_Pos) |
                    (CAMERA_AI_HEIGHT << DCMIPP_P2DSSZR_VSIZE_Pos);
  /* The static-image path writes RGB bytes in R,G,B order. Keep the camera
   * tensor in the same order; `cam swaprb` can opt into B,R swapping. */
  DCMIPP->P2PPCR = 0U; /* RGB888, one memory plane. */
  DCMIPP->P2PPM0PR = CAMERA_AI_PITCH_BYTES;
  DCMIPP->P2FCR = DCMIPP_P2FCR_CFRAMEF | DCMIPP_P2FCR_COVRF |
                  DCMIPP_P2FCR_CVSYNCF;

  return CAMERA_DEMO_OK;
}

static void CameraDemo_StartPipe1(void)
{
  uint8_t *ai_input = AIInstanceSegmentation_GetInputBuffer();

  SCB_CleanInvalidateDCache_by_Addr((uint32_t *)s_camera_preview, sizeof(s_camera_preview));
  CameraDemo_UpdatePipe1Rois();
  DCMIPP->P1FCR = DCMIPP_P1FCR_CFRAMEF | DCMIPP_P1FCR_COVRF |
                  DCMIPP_P1FCR_CVSYNCF;
  DCMIPP->P1PPM0AR1 = (uint32_t)s_camera_preview;
  DCMIPP->P1FCTCR = DCMIPP_MODE_SNAPSHOT;
  DCMIPP->P1FSCR = DCMIPP_DT_RAW10 | DCMIPP_P1FSCR_PIPEN;
  s_ai_capture_armed = (ai_input != NULL) ? 1U : 0U;
  if (s_ai_capture_armed != 0U)
  {
    SCB_CleanInvalidateDCache_by_Addr((uint32_t *)ai_input,
                                      CAMERA_AI_PITCH_BYTES * CAMERA_AI_HEIGHT);
    DCMIPP->P2FCR = DCMIPP_P2FCR_CFRAMEF | DCMIPP_P2FCR_COVRF |
                    DCMIPP_P2FCR_CVSYNCF;
    DCMIPP->P2PPM0AR1 = (uint32_t)ai_input;
    DCMIPP->P2FCTCR = DCMIPP_P2FCTCR_CPTMODE;
    DCMIPP->P2FSCR = DCMIPP_DT_RAW10 | DCMIPP_P2FSCR_PIPEN;
    DCMIPP->P2FCTCR |= DCMIPP_P2FCTCR_CPTREQ;
  }
  /* Arm both pipes before the next CSI frame arrives. */
  DCMIPP->P1FCTCR |= DCMIPP_P1FCTCR_CPTREQ;
}

static CameraDemoStatus CameraDemo_WaitPipe1Frame(void)
{
  if (ulTaskNotifyTake(pdTRUE, pdMS_TO_TICKS(CAMERA_CAPTURE_TIMEOUT_MS)) == 0U)
  {
    if ((DCMIPP->P1SR & DCMIPP_P1SR_OVRF) != 0U)
    {
      CameraDemo_UpdateDebug();
      return CAMERA_DEMO_OVERRUN;
    }
    CameraDemo_UpdateDebug();
    return CAMERA_DEMO_FRAME_TIMEOUT;
  }

  CameraDemo_UpdateDebug();
  CameraDemo_UpdateFrameBufferStats();
  /* Refresh the sensor register snapshot here, in the camera task (which owns
   * I2C2), so `cam status` can cross-check the cache against live hardware
   * without the shell task ever touching the I2C bus. */
  CameraDemo_UpdateSensorDebug();
  DCMIPP->P1FCR = DCMIPP_P1FCR_CFRAMEF | DCMIPP_P1FCR_CVSYNCF;
  CameraDemo_CopyPreviewToLcd();
  if (s_ai_capture_armed != 0U)
  {
    TickType_t start = xTaskGetTickCount();

    /* Pipe1 and Pipe2 finish independently. FRAMEF may already be set when
     * the Pipe1 interrupt wakes this task, so preserve it until the frame has
     * been handed to AI. Clearing it here would wait for a second completion
     * from a one-shot capture request. */
    while ((DCMIPP->P2SR & DCMIPP_P2SR_FRAMEF) == 0U)
    {
      if ((DCMIPP->P2SR & DCMIPP_P2SR_OVRF) != 0U)
      {
        break;
      }
      if ((xTaskGetTickCount() - start) >= pdMS_TO_TICKS(CAMERA_PIPE2_WAIT_MS))
      {
        break;
      }
      taskYIELD();
    }

    if ((DCMIPP->P2SR & DCMIPP_P2SR_FRAMEF) != 0U)
    {
      DCMIPP->P2FCR = DCMIPP_P2FCR_CFRAMEF | DCMIPP_P2FCR_CVSYNCF;
      AIInstanceSegmentation_SubmitCameraFrame();
    }
    else
    {
      AIInstanceSegmentation_CancelFrame();
      LOG_WARN("camera: pipe2 frame missing, p2sr=0x%08lx\r\n",
               (unsigned long)DCMIPP->P2SR);
    }
  }
  return CAMERA_DEMO_OK;
}

CameraDemoStatus CameraDemo_Init(uint16_t *sensor_id)
{
  s_camera_task = xTaskGetCurrentTaskHandle();

  IMX415_BusInit();
  if (IMX415_ReadID(sensor_id) != IMX415_OK)
  {
    return CAMERA_DEMO_SENSOR_ID_ERROR;
  }
  if ((*sensor_id & 0x0FFFU) != IMX415_CHIP_ID)
  {
    return CAMERA_DEMO_SENSOR_ID_ERROR;
  }
  if (IMX415_InitStream() != IMX415_OK)
  {
    return CAMERA_DEMO_SENSOR_INIT_ERROR;
  }
  if (IMX415_EnableTestPattern(CAMERA_USE_TEST_PATTERN) != IMX415_OK)
  {
    return CAMERA_DEMO_SENSOR_INIT_ERROR;
  }
  if (CameraDemo_CSIInit() != CAMERA_DEMO_OK)
  {
    return CAMERA_DEMO_CSI_INIT_ERROR;
  }
  if (IMX415_StartStream() != IMX415_OK)
  {
    return CAMERA_DEMO_SENSOR_STREAM_ERROR;
  }

  CSI->CR |= CSI_CR_VC0START;
  TickType_t start = xTaskGetTickCount();
  while ((CSI->SR0 & CSI_SR0_VC0STATEF) == 0U)
  {
    if ((xTaskGetTickCount() - start) > pdMS_TO_TICKS(CAMERA_CAPTURE_TIMEOUT_MS))
    {
      CameraDemo_UpdateDebug();
      return CAMERA_DEMO_CSI_WAIT_TIMEOUT;
    }
  }
  CameraDemo_UpdateSensorDebug();
  return CAMERA_DEMO_OK;
}

void CameraDemo_DCMIPP_IRQHandler(void)
{
  BaseType_t higher_priority_task_woken = pdFALSE;
  uint32_t status = DCMIPP->P1SR;

  if (((status & DCMIPP_P1SR_FRAMEF) != 0U) &&
      ((DCMIPP->P1IER & DCMIPP_P1IER_FRAMEIE) != 0U))
  {
    DCMIPP->P1FCR = DCMIPP_P1FCR_CFRAMEF;
    if (s_camera_task != NULL)
    {
      vTaskNotifyGiveFromISR(s_camera_task, &higher_priority_task_woken);
    }
  }

  portYIELD_FROM_ISR(higher_priority_task_woken);
}

/* ---- runtime control application (runs in camera task, owns I2C2 + DCMIPP) ---- */

static int CameraDemo_ConvertGain(uint16_t gain_x1000, uint8_t *shift, uint8_t *multiplier)
{
  uint32_t scaled = (uint32_t)gain_x1000 * 128U;
  uint8_t s = 0U;

  while ((((scaled + 500U) / 1000U) > 255U) && (s < 3U))
  {
    scaled = (scaled + 1U) / 2U;
    s++;
  }

  uint32_t m = (scaled + 500U) / 1000U;

