nickfox-taterli/stm32n647-template/app/Core/Src/drivers/camera_demo.c
  if ((m < 1U) || (m > 255U))
  {
    return -1;
  }

  /* gain ~= multiplier / 128 * 2^shift; SHF fields are 3 bits, s is 0..3. */
  *shift = s;
  *multiplier = (uint8_t)m;
  return 0;
}

static CameraDemoStatus CameraDemo_ApplyWhiteBalance(const CameraDemoControls *controls)
{
  uint8_t shift_r;
  uint8_t mult_r;
  uint8_t shift_g;
  uint8_t mult_g;
  uint8_t shift_b;
  uint8_t mult_b;

  if (CameraDemo_ConvertGain(controls->wb_r_x1000, &shift_r, &mult_r) != 0)
  {
    return CAMERA_DEMO_INVALID_ARGUMENT;
  }
  if (CameraDemo_ConvertGain(controls->wb_g_x1000, &shift_g, &mult_g) != 0)
  {
    return CAMERA_DEMO_INVALID_ARGUMENT;
  }
  if (CameraDemo_ConvertGain(controls->wb_b_x1000, &shift_b, &mult_b) != 0)
  {
    return CAMERA_DEMO_INVALID_ARGUMENT;
  }

  MODIFY_REG(DCMIPP->P1EXCR1,
             DCMIPP_P1EXCR1_SHFR | DCMIPP_P1EXCR1_MULTR,
             ((uint32_t)shift_r << DCMIPP_P1EXCR1_SHFR_Pos) |
             ((uint32_t)mult_r << DCMIPP_P1EXCR1_MULTR_Pos));

  MODIFY_REG(DCMIPP->P1EXCR2,
             DCMIPP_P1EXCR2_SHFG | DCMIPP_P1EXCR2_MULTG |
             DCMIPP_P1EXCR2_SHFB | DCMIPP_P1EXCR2_MULTB,
             ((uint32_t)shift_g << DCMIPP_P1EXCR2_SHFG_Pos) |
             ((uint32_t)mult_g << DCMIPP_P1EXCR2_MULTG_Pos) |
             ((uint32_t)shift_b << DCMIPP_P1EXCR2_SHFB_Pos) |
             ((uint32_t)mult_b << DCMIPP_P1EXCR2_MULTB_Pos));

  SET_BIT(DCMIPP->P1EXCR1, DCMIPP_P1EXCR1_ENABLE);

  return CAMERA_DEMO_OK;
}

static CameraDemoStatus CameraDemo_ApplyBayerPattern(CameraBayerPattern pattern)
{
  uint32_t raw;

  switch (pattern)
  {
    case CAMERA_BAYER_RGGB: raw = DCMIPP_RAWBAYER_RGGB; break;
    case CAMERA_BAYER_GRBG: raw = DCMIPP_RAWBAYER_GRBG; break;
    case CAMERA_BAYER_GBRG: raw = DCMIPP_RAWBAYER_GBRG; break;
    case CAMERA_BAYER_BGGR: raw = DCMIPP_RAWBAYER_BGGR; break;
    default: return CAMERA_DEMO_INVALID_ARGUMENT;
  }

  MODIFY_REG(DCMIPP->P1DMCR, DCMIPP_P1DMCR_TYPE, raw);
  SET_BIT(DCMIPP->P1DMCR, DCMIPP_P1DMCR_ENABLE);

  return CAMERA_DEMO_OK;
}

/* Apply every pending control between two snapshots. All I2C / DCMIPP access
 * happens here, in the camera task. On any failure the not-yet-applied claimed
 * bits are restored so the next frame retries them; nothing is silently lost. */
static CameraDemoStatus CameraDemo_ApplyPendingControls(void)
{
  CameraDemoControls pending;
  uint32_t claimed;
  uint32_t applied = 0U;

  taskENTER_CRITICAL();
  pending = s_pending_controls;
  claimed = s_control_dirty;
  s_control_dirty &= ~claimed;
  taskEXIT_CRITICAL();

  if (claimed == 0U)
  {
    return CAMERA_DEMO_OK;
  }

  if ((claimed & CAMERA_CTRL_DIRTY_TPG) != 0U)
  {
    if (IMX415_SetTestPattern(pending.test_pattern) != IMX415_OK)
    {
      goto apply_failed;
    }
    s_active_controls.test_pattern = pending.test_pattern;
    applied |= CAMERA_CTRL_DIRTY_TPG;
  }

  if ((claimed & CAMERA_CTRL_DIRTY_EXPOSURE) != 0U)
  {
    if (IMX415_SetExposureLines(pending.exposure_lines) != IMX415_OK)
    {
      goto apply_failed;
    }
    s_active_controls.exposure_lines = pending.exposure_lines;
    applied |= CAMERA_CTRL_DIRTY_EXPOSURE;
  }

  if ((claimed & CAMERA_CTRL_DIRTY_AGAIN) != 0U)
  {
    if (IMX415_SetAnalogGain(pending.analog_gain) != IMX415_OK)
    {
      goto apply_failed;
    }
    s_active_controls.analog_gain = pending.analog_gain;
    applied |= CAMERA_CTRL_DIRTY_AGAIN;
  }

  if ((claimed & CAMERA_CTRL_DIRTY_BAYER) != 0U)
  {
    if (CameraDemo_ApplyBayerPattern(pending.bayer) != CAMERA_DEMO_OK)
    {
      goto apply_failed;
    }
    s_active_controls.bayer = pending.bayer;
    applied |= CAMERA_CTRL_DIRTY_BAYER;
  }

  if ((claimed & CAMERA_CTRL_DIRTY_WB) != 0U)
  {
    if (CameraDemo_ApplyWhiteBalance(&pending) != CAMERA_DEMO_OK)
    {
      goto apply_failed;
    }
    s_active_controls.wb_r_x1000 = pending.wb_r_x1000;
    s_active_controls.wb_g_x1000 = pending.wb_g_x1000;
    s_active_controls.wb_b_x1000 = pending.wb_b_x1000;
    applied |= CAMERA_CTRL_DIRTY_WB;
  }

  if ((claimed & CAMERA_CTRL_DIRTY_SWAP_RB) != 0U)
  {
    /* Software-only state, consumed by CopyPreviewToLcd(). Cannot fail. */
    s_active_controls.swap_rb = pending.swap_rb;
    applied |= CAMERA_CTRL_DIRTY_SWAP_RB;
  }

  return CAMERA_DEMO_OK;

apply_failed:
  taskENTER_CRITICAL();
  s_control_dirty |= (claimed & ~applied);
  taskEXIT_CRITICAL();
  return CAMERA_DEMO_CONTROL_APPLY_ERROR;
}

CameraDemoStatus CameraDemo_CaptureToLcd(void)
{
  CameraDemoStatus status = CameraDemo_ApplyPendingControls();
  if (status != CAMERA_DEMO_OK)
  {
    return status;
  }

  CameraDemo_StartPipe1();
  return CameraDemo_WaitPipe1Frame();
}

void CameraDemo_GetDebug(CameraDemoDebug *debug)
{
  if (debug != 0)
  {
    *debug = s_camera_debug;
  }
}

/* ---- shell-facing setters: validate, then update pending + dirty atomically ---- */

CameraDemoStatus CameraDemo_SetExposureLines(uint32_t exposure_lines)
{
  if ((exposure_lines < IMX415_EXPOSURE_MIN_LINES) ||
      (exposure_lines > (IMX415_DEMO_VMAX_LINES - IMX415_EXPOSURE_OFFSET_LINES)))
  {
    return CAMERA_DEMO_INVALID_ARGUMENT;
  }

  taskENTER_CRITICAL();
  s_pending_controls.exposure_lines = exposure_lines;
  s_control_dirty |= CAMERA_CTRL_DIRTY_EXPOSURE;
  taskEXIT_CRITICAL();
  return CAMERA_DEMO_OK;
}

CameraDemoStatus CameraDemo_SetAnalogGain(uint16_t gain)
{
  /* gain is unsigned, so IMX415_ANALOG_GAIN_MIN (0) is the natural floor;
   * only the upper bound is a real constraint here. */
  if (gain > IMX415_ANALOG_GAIN_MAX)
  {
    return CAMERA_DEMO_INVALID_ARGUMENT;
  }

  taskENTER_CRITICAL();
  s_pending_controls.analog_gain = gain;
  s_control_dirty |= CAMERA_CTRL_DIRTY_AGAIN;
  taskEXIT_CRITICAL();
  return CAMERA_DEMO_OK;
}

CameraDemoStatus CameraDemo_SetWhiteBalance(uint16_t r_x1000,
                                            uint16_t g_x1000,
                                            uint16_t b_x1000)
{
  if ((r_x1000 < CAMERA_WB_MIN_X1000) || (r_x1000 > CAMERA_WB_MAX_X1000) ||
      (g_x1000 < CAMERA_WB_MIN_X1000) || (g_x1000 > CAMERA_WB_MAX_X1000) ||
      (b_x1000 < CAMERA_WB_MIN_X1000) || (b_x1000 > CAMERA_WB_MAX_X1000))
  {
    return CAMERA_DEMO_INVALID_ARGUMENT;
  }

