nickfox-taterli/stm32n647-template/app/Core/Src/drivers/camera_demo.c
  taskENTER_CRITICAL();
  s_pending_controls.wb_r_x1000 = r_x1000;
  s_pending_controls.wb_g_x1000 = g_x1000;
  s_pending_controls.wb_b_x1000 = b_x1000;
  s_control_dirty |= CAMERA_CTRL_DIRTY_WB;
  taskEXIT_CRITICAL();
  return CAMERA_DEMO_OK;
}

CameraDemoStatus CameraDemo_SetBayerPattern(CameraBayerPattern pattern)
{
  if ((pattern != CAMERA_BAYER_RGGB) &&
      (pattern != CAMERA_BAYER_GRBG) &&
      (pattern != CAMERA_BAYER_GBRG) &&
      (pattern != CAMERA_BAYER_BGGR))
  {
    return CAMERA_DEMO_INVALID_ARGUMENT;
  }

  taskENTER_CRITICAL();
  s_pending_controls.bayer = pattern;
  s_control_dirty |= CAMERA_CTRL_DIRTY_BAYER;
  taskEXIT_CRITICAL();
  return CAMERA_DEMO_OK;
}

CameraDemoStatus CameraDemo_SetTestPattern(IMX415_TestPattern pattern)
{
  if ((pattern != IMX415_TEST_PATTERN_OFF) &&
      (pattern != IMX415_TEST_PATTERN_HORIZONTAL_COLOR_BAR) &&
      (pattern != IMX415_TEST_PATTERN_VERTICAL_COLOR_BAR))
  {
    return CAMERA_DEMO_INVALID_ARGUMENT;
  }

  taskENTER_CRITICAL();
  s_pending_controls.test_pattern = pattern;
  s_control_dirty |= CAMERA_CTRL_DIRTY_TPG;
  taskEXIT_CRITICAL();
  return CAMERA_DEMO_OK;
}

CameraDemoStatus CameraDemo_SetSwapRB(uint8_t enable)
{
  taskENTER_CRITICAL();
  s_pending_controls.swap_rb = (enable != 0U) ? 1U : 0U;
  s_control_dirty |= CAMERA_CTRL_DIRTY_SWAP_RB;
  taskEXIT_CRITICAL();
  return CAMERA_DEMO_OK;
}

CameraDemoStatus CameraDemo_RestoreDefaults(void)
{
  taskENTER_CRITICAL();
  s_pending_controls.exposure_lines = IMX415_DEMO_EXPOSURE_LINES;
  s_pending_controls.analog_gain = IMX415_DEMO_ANALOG_GAIN;
  s_pending_controls.wb_r_x1000 = CAMERA_WB_DEFAULT_R_X1000;
  s_pending_controls.wb_g_x1000 = CAMERA_WB_DEFAULT_G_X1000;
  s_pending_controls.wb_b_x1000 = CAMERA_WB_DEFAULT_B_X1000;
  s_pending_controls.bayer = CAMERA_BAYER_GBRG;
  s_pending_controls.test_pattern = IMX415_TEST_PATTERN_OFF;
  s_pending_controls.swap_rb = 0U;
  s_control_dirty |= CAMERA_CTRL_DIRTY_ALL;
  taskEXIT_CRITICAL();
  return CAMERA_DEMO_OK;
}

void CameraDemo_GetControls(CameraDemoControls *active,
                            CameraDemoControls *pending,
                            uint32_t *dirty_mask)
{
  taskENTER_CRITICAL();
  if (active != 0)
  {
    *active = s_active_controls;
  }
  if (pending != 0)
  {
    *pending = s_pending_controls;
  }
  if (dirty_mask != 0)
  {
    *dirty_mask = s_control_dirty;
  }
  taskEXIT_CRITICAL();
}

void CameraDemo_GetSensorDebug(IMX415_DebugRegisters *registers)
{
  if (registers != 0)
  {
    *registers = s_sensor_debug;
  }
}
